/*
Представим, подписка на Яндекс.Музыку стоит 169 рублей в месяц, а на КиноПоиск HD — 269 рублей.
Напиши выражение, которое выведет общую сумму подписок за месяц. Примени оператор сложения.
*/

console.log(169 + 269);

/*
Дизайнер Олег работает из дома. 137 минут он ругался в Facebook, 122 минуты лайкал фотки в Instagram, 43 минуты читал группы в VK и 58 минут смотрел новые видео в TikTok. Оставшееся время из 8-часового рабочего дня дизайнер Олег рисовал макеты.
Примени операторы сложения, вычитания, деления, умножения и группировки, чтобы посчитать, какое количество часов Олег потратил на макеты. Результат расчёта выведи в консоль.
*/

console.log((8 * 60 - (137 + 122 + 43 + 58))/60);