/*
Подставь оператор сравнения: больше >; меньше или равно <= ; или идентично === ; так, чтобы все выражения вернули значение true.
*/

console.log(2 * 2 <= 5);
console.log('back' === 'back');
console.log(true > false);

/*
Подставь оператор сравнения «равно» == или «не равно» != так, чтобы все выражения вернули значение false.
*/

console.log(7  !=   '7');
console.log('аА' == 'Аа');
console.log((25 * 12 + 1) * 4 / 5  !=  (50 * 6 + 2 * 0.5) / 1.25);
console.log(true * true  ==  false * false);

/*
Объяви переменную x с целочисленным значением 8. Напиши логическое выражение, которое проверяет, что x находится в диапазоне 5 < x ≤ 10. Выведи результат в консоль.
*/

let x = 8; // допиши значение переменной
console.log(x > 5 && x <= 10 ); // допиши логическое выражение