/*
Создай функцию, которая склеит две строки.
Назови её glueText.
Объяви две переменные text1 и text2.
В text1 запиши значение «Мы все учились понемногу...», а в text2 — «А сейчас ты учишься программировать на JS!»
Вызови эту функцию с аргументами text1 и text2.
Внутри функции примени команду alert, чтобы вывести склеенные строки.
*/

function glueText(text1, text2){alert(text1 + text2)};
let text1 = "Мы все учились понемногу...";
let text2 = "А сейчас ты учишься программировать на JS!";
glueText(text1, text2);